Revit 2027 API
PresetInitialColor.Preset Property
 The preset value
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColorPreset Preset { get; set; }
Public Property Preset As ColorPreset
	Get
	Set
public:
property ColorPreset Preset {
	ColorPreset get ();
	void set (ColorPreset value);
}
member Preset : ColorPreset with get, set
Property Value
ColorPreset
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PresetInitialColor Class
Autodesk.Revit.DB.Lighting Namespace